[
  {
    "employer": "Shopify",
    "position": "Senior Developer",
    "timeFrame": "Jan. 2021 - Present",
    "technologies": ["Rails"]
  },
  {
    "employer": "Bell Media",
    "position": "Senior Solutions Architect",
    "timeFrame": "Apr. 2020 - Jan. 2021",
    "technologies": ["Java", "Spring", "Javascript"],
    "accomplishments": [
      "Lead the design and development of large-scale media, entertainment and lifestyle websites.",
      "Engaging with teams across Bell Media to plan and execute future projects.",
      "Developing a shared codebase to be used across Bell Media brands.",
      "Lead and participate in solution design sessions."
    ]
  },
  {
    "employer": "Vention",
    "position": "Full Stack Developer",
    "timeFrame": "Nov. 2019 - Apr. 2020",
    "technologies": ["Rails", "TypeScript", "React", "PostgreSQL"],
    "accomplishments": [
      "Worked on revamping the user documentation section for a better user experience and allow staff to quickly publish new documentation.",
      "Worked on reducing the time spent integration new parts to the site by allowing partner companies to publish parts through a partner dashboard.",
      "Delivered major features to completion working on both the front-end and back-end."
    ]
  },
  {
    "employer": "Bell Media",
    "position": "Software Developer",
    "timeFrame": "Feb. 2017 - Oct. 2019",
    "technologies": ["Java", "Spring", "JavaScript", "MySQL", "Jenkins"],
    "accomplishments": [
      "Developed web applications to support numerous large-scale media, entertainment and lifestyle websites.",
      "Supporting and improving existing web applications such as a CMS, radio scheduling application, audio upload application, and more.",
      "Designed and developed a service to provide the song history for over 100 radio stations."
    ]
  },
  {
    "employer": "Ubisoft",
    "position": "Online Programmer",
    "timeFrame": "2016 Internship",
    "technologies": ["JavaScript", "Node.js"],
    "accomplishments": [
      "Designed and implemented an express server running Swagger to aggregate API documentation for dozens of microservices.",
      "To facilitate a migration to AWS, I developed a proxy server which logs requests to the on-premise and cloud environment applications to identify any performance regressions."
    ]
  }
]
